CSI API ETABS v1
cSapModel.GetDatabaseUnits Method
 Returns a value from the eUnits enumeration indicating the database units for the model. All data is internally stored in the model in these units and converted to the present units as needed.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
eUnits GetDatabaseUnits()
Function GetDatabaseUnits As eUnits
Dim instance As cSapModel
Dim returnValue As eUnits
returnValue = instance.GetDatabaseUnits()
eUnits GetDatabaseUnits()
abstract GetDatabaseUnits : unit -> eUnits
Return Value
Type: eUnits
 Returns a value from the eUnits enumeration if successful, otherwise returns zero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get database units
       Dim dbUnits as eUnits
       dbUnits = SapModel.GetDatabaseUnits()
   'run model (this will create the analysis model)
       ret = SapModel.Analyze.RunAnalysis
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace